In [10]:
import pandas as pd
dp=pd.DataFrame()
print(dp)

Empty DataFrame
Columns: []
Index: []

In [35]:
emp=pd.Series(['dharsan','sundeep','barath','siva','yash'])
id=pd.Series([80,90,28,57,49])
frame={'EMP':emp,'ID':id}
result=pd.DataFrame(frame)
print(result)

       EMP  ID
0  dharsan  80
1  sundeep  90
2   barath  28
3     siva  57
4     yash  49

In [36]:
print("\n Extracting one column:\n")
print(result['EMP'])

 Extracting one column:

0    dharsan
1    sundeep
2     barath
3       siva
4       yash
Name: EMP, dtype: object

In [40]:
print("\nAdding new columns:\n")
result['ID']=pd.Series([80,96,28,56,70])
result['Age']=pd.Series([28,32,47,53,61])
print(result)

Adding new columns:

       EMP  ID  Age
0  dharsan  80   28
1  sundeep  96   32
2   barath  28   47
3     siva  56   53
4     yash  70   61

In [41]:
print("\n Deleting new column:\n")
del result['Age']
print(result)

 Deleting new column:

       EMP  ID
0  dharsan  80
1  sundeep  96
2   barath  28
3     siva  56
4     yash  70

In [48]:
print("\n Extracting the second row:\n")
print(result.loc[1])

 Extracting the second row:

EMP    sundeep
ID          96
Name: 1, dtype: object

In [54]:
print("slice rows:\n", result[1:4])

slice rows:
        EMP  ID
1  sundeep  96
2   barath  28
3     siva  56

In [55]:
d2=pd.DataFrame([['vicky',100],['Rashid',110]],columns=['EMP','ID'])
print("\nAdding new row values:\n",pd.concat([result,d2]))

Adding new row values:
        EMP   ID
0  dharsan   80
1  sundeep   96
2   barath   28
3     siva   56
4     yash   70
0    vicky  100
1   Rashid  110

In [56]:
print("\n deleting particular row:\n",result.drop(2))

 deleting particular row:
        EMP  ID
0  dharsan  80
1  sundeep  96
3     siva  56
4     yash  70